# Wall

Representation of Wall in IDEA StatiCa Detail

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.wall import Wall

# TODO update the JSON string below
json = "{}"
# create an instance of Wall from a JSON string
wall_instance = Wall.from_json(json)
# print the JSON string representation of the object
print(Wall.to_json())

# convert the object into a dict
wall_dict = wall_instance.to_dict()
# create an instance of Wall from a dict
wall_from_dict = Wall.from_dict(wall_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)